Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [73]:
import numpy as np
import pandas as pd
from sqlalchemy import text, create_engine
from pydataset import data

from env import get_connection

In [10]:
engine = create_engine(get_connection('chipotle'))

In [15]:
chipotle_query = '''

SELECT *
FROM orders
;

'''

In [16]:
chipotle_orders = pd.read_sql(text(chipotle_query), engine.connect())

In [47]:
chipotle_orders

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [22]:
chipotle_orders.groupby('order_id').item_price.sum()

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

In [28]:
# chipotle_orders_num = chipotle_orders.copy()

In [30]:
# chipotle_orders_num.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [43]:
# chip_float = [chipotle_orders.item_price.str.replace('$','').astype('float')]

/var/folders/__/8b23nn817hq5cnv1011jx8kr0000gn/T/ipykernel_14200/2369708716.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chip_float = [chipotle_orders.item_price.str.replace('$','').astype('float')]

In [44]:
# pd.Series(chip_float)

0    0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
46...
dtype: object

In [ ]:
# pd.concat([chipotle_orders, chip_float], axis=1)

In [49]:
chipotle_orders['chip_float'] = chipotle_orders.item_price.str.replace('$','').astype('float')

/var/folders/__/8b23nn817hq5cnv1011jx8kr0000gn/T/ipykernel_14200/1745566236.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chipotle_orders['chip_float'] = chipotle_orders.item_price.str.replace('$','').astype('float')

2. What is the total price for each order?

In [51]:
# This is the AWNSER
chipotle_orders.groupby('order_id').chip_float.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: chip_float, Length: 1834, dtype: float64

3. What are the most popular 3 items?

Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506

In [67]:
chipotle_orders.groupby('item_name').quantity.agg('sum').sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

4. Which item has produced the most revenue?
Chicken Bowl

In [68]:
chipotle_orders.head()

,id,order_id,quantity,item_name,choice_description,item_price,chip_float
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98,16.98

In [69]:
chipotle_orders.groupby('item_name').chip_float.agg('sum').sort_values(ascending=False).head(2)

item_name
Chicken Bowl       7342.73
Chicken Burrito    5575.82
Steak Burrito      3851.43
Name: chip_float, dtype: float64

5. Join the employees and titles DataFrames together.

In [72]:
employees_query = '''
              SELECT *
              FROM employees
              '''

titles_query = '''
              SELECT *
              FROM titles
              '''

In [89]:
engine2 = create_engine(get_connection('employees'))

In [75]:
employees = pd.read_sql(text(employees_query), engine2.connect())
titles = pd.read_sql(text(titles_query), engine2.connect())

In [80]:
emp_titles = employees.merge(titles, how = 'left' , left_on = 'emp_no' , right_on = 'emp_no')

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [86]:
emp_titles.sort_values('to_date', ascending=False).groupby('title').first()

,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date,to_date
title,,,,,,,,
Assistant Engineer,270060,1958-12-10,Fumiyo,Benzaken,F,1987-01-02,1997-12-24,9999-01-01
Engineer,270068,1953-04-02,Mantis,Gimbel,M,1997-06-02,1999-04-09,9999-01-01
Manager,110039,1963-06-21,Vishwani,Minakawa,M,1986-04-12,1991-10-01,9999-01-01
Senior Engineer,10001,1953-09-02,Georgi,Facello,M,1986-06-26,1986-06-26,9999-01-01
Senior Staff,270070,1963-07-15,Wojceich,Karlin,F,1994-12-30,1994-12-30,9999-01-01
Staff,270061,1962-09-16,Lillian,Ohori,M,1997-08-25,1999-11-27,9999-01-01
Technique Leader,270052,1952-06-10,Sanjay,Serna,F,1987-03-11,1993-03-27,9999-01-01

In [85]:
# doesnt get name or emp number
emp_titles.groupby('title').to_date.agg(['max'])

                           max
title
Assistant Engineer  9999-01-01
Engineer            9999-01-01
Manager             9999-01-01
Senior Engineer     9999-01-01
Senior Staff        9999-01-01
Staff               9999-01-01
Technique Leader    9999-01-01

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [92]:
dept_emp_query = '''
              SELECT *
              FROM dept_emp
              '''

departments_query = '''
              SELECT *
              FROM departments
              '''

In [93]:
dept_emp = pd.read_sql(text(dept_emp_query), engine2.connect())
departments = pd.read_sql(text(departments_query), engine2.connect())

In [98]:
dept_emp_t = emp_titles.merge(dept_emp, how = 'left' , left_on = 'emp_no' , right_on = 'emp_no')

In [102]:
big_dept = dept_emp_t.merge(departments , how = 'left' , left_on='dept_no', right_on='dept_no')

In [106]:
pd.crosstab(big_dept.dept_name , big_dept.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0

In [104]:
# Doesn't run
# value counts or cross tab prob will
# big_dept.dept_name.groupby().title.agg('count')

TypeError: You have to supply one of 'by' and 'level'